app/controllers/pastes_controller.rb

  def show
    @paste = Paste.find_by_id(params[:id])
---
SELECT "pastes".* FROM "pastes" WHERE "pastes"."id" = 0 LIMIT 1

  def new
    @paste = Paste.new
    @parsers = Parser.order('display_name desc')
---
SELECT "parsers".* FROM "parsers" ORDER BY display_name